Repository: 84000/data-translation-memory
Catalog: toh556-v3.tmx
Source language: bo
Languages: en

source: གལ་ཏེ་བཅོམ་ལྡན་འདས་སེམས་ཅན་ཐམས་ཅད་ལ་ཐུགས་བརྩེ་བ། ཐུགས་རྗེ་ཆེན་པོ་དང་ལྡན་པ་ཕན་པར་བཞེད་པ། སེམས་ཅན་ཐམས་ཅད་ལ་ཕ་མ་ལྟ་བུ་མི་མཉམ་པ་དང་མཉམ་པར་གྱུར་པ། ཟླ་བ་ལྟ་བུ་སྣང་བ་མཛད་པ། ཤེས་རབ་དང་ཡེ་ཤེས་ཆེན་པོའི་ཉི་མ་ཤར་བ་ལྟ་བུ་ལགས་ཤིང་། གལ་ཏེ་ཁྱོད་སེམས་ཅན་ཐམས་ཅད་ལ་སྒྲ་གཅན་ཟིན་བཞིན་དུ་གཟིགས་ན། བདག་ལ་དམ་པ་ཞིག་སྩལ་དུ་གསོལ།
en: On hearing these words concerning the great nirvāṇa of the Tathāgata, he immediately wept, bowed down to the feet of the Bhagavat, and said to the Bhagavat, “If you have love for all beings, if you have great compassion, if you wish to benefit them, if you are a mother and father for all beings, if you are unequaled, if you are like the moon radiating light, if you are like a risen sun of great wisdom and knowledge, and if you look upon all beings as you do upon Rāhula, then I pray that you grant me something sacred.”

source: བཅོམ་ལྡན་འདས་ཅང་མི་གསུང་བར་གྱུར་ཏོ། །
en: The Bhagavat remained silent.

source: དེ་ནས་སངས་རྒྱས་ཀྱི་མཐུས་འཁོར་དེར་ལིཙྪ་བཱི་གཞོན་ནུ་སེམས་ཅན་ཐམས་ཅད་ཀྱིས་མཐོང་ན་དགའ་བ་ཞེས་བྱ་བ་དེ་སྤོབས་པ་སྐྱེས་ནས།
en: Then, through the power of the Buddha, there arose confident eloquence in a Licchavī youth who was in that assembly, whose name was Sarva­sattva­priya­darśana.

source: སློབ་དཔོན་ལུང་སྟོན་པ་བྲམ་ཟེ་ཀཽཎྜི་ནྱ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ཅི་བྲམ་ཟེ་ཆེན་པོ་ཁྱོད་བཅོམ་ལྡན་འདས་ལ་དམ་པ་གཅིག་གསོལ་ལམ།
en: He asked the Kauṇḍinya brahmin, the Dharma master Vyākaraṇa, “Great brahmin, why do you ask the Bhagavat for something sacred?

source: བདག་གིས་ཁྱོད་ལ་དམ་པ་སྦྱིན་ནོ། །
en: I will give you something sacred.”

source: བྲམ་ཟེས་སྨྲས་པ། ལིཙྪ་བཱི་གཞོན་ནུ་བདག་ནི། བཅོམ་ལྡན་འདས་ལ་མཆོད་པ་དང་། རིང་བསྲེལ་གྱི་ཕྱེ་མ་དགོས་པའི་ཕྱིར། བཅོམ་ལྡན་འདས་ཀྱི་རིང་བསྲེལ་ཡུངས་འབྲུ་ཙམ་ལ་བརྟེན་པར་འདོད་དོ། །
en: “Licchavī youth,” said the brahmin, “I wish for a relic of the Bhagavat the size of a mustard seed in order to make offerings to the Bhagavat.

source: རིང་བསྲེལ་ཡུངས་འབྲུ་ཙམ་དེ་མངོན་པར་མཆོད་ན། སུམ་ཅུ་རྩ་གསུམ་གྱི་ལྷ་རྣམས་ཀྱི་བདག་པོ་འབའ་ཞིག་འཐོབ་ཅེས་གྲག་གོ། །
en: It is known that if one makes offerings to a relic the size of a mustard seed that one has received as a share of the ashes that are the relics of the Bhagavat, one will become the sole lord of the devas of Trāyastriṃśa.

source: ཀྱེ་ལིཙྪ་བཱི་གཞོན་ནུ་གསེར་འོད་དམ་པའི་མདོ་ཉན་ཐོས་དང་།
en: “O Licchavī youth, it is difficult for śrāvakas and pratyekabuddhas to know The Sūtra of the Sublime Golden Light.

source: རང་སངས་རྒྱས་ཐམས་ཅད་ཀྱིས་ཤེས་པར་དཀའ་བ།
en: It is difficult for them to comprehend it.

source: ཁོང་དུ་ཆུད་པར་དཀའ་བ་དེ་ལྟ་བུའི་མཚན་ཉིད་དང་ཡོན་ཏན་དང་ལྡན་པ། གསེར་འོད་དམ་པའི་མདོ་འཆད་ཅེས་གྲག་གིས་ཉོན་ཅིག །
en: The Sūtra of the Sublime Golden Light, which has those characteristics and qualities, is going to be spoken, so listen!

source: ཀྱེ་ལིཙྪ་བཱི་གཞོན་ནུ་གསེར་འོད་དམ་པའི་མདོ་འདི་ནི་དེ་ལྟར་ཤེས་པར་དཀའ་ཞིང་རྟོགས་པར་དཀའ་བས་ན།
en: “O Licchavī youth, The Sūtra of the Sublime Golden Light is thus difficult to know and difficult to understand.

source: ཁོ་བོ་ཅག་མཐའ་འཁོབ་ཀྱི་གླིང་གི་བྲམ་ཟེ་རྣམས་ནི་གང་བཅངས་ནས། སེམས་ཅན་རྣམས་མྱུར་དུ་སུམ་ཅུ་རྩ་གསུམ་པའི་བདག་པོ་ཐོབ་པར་འགྱུར་བའི་རིང་བསྲེལ་ཡུངས་འབྲུ་ཙམ་ཟ་མ་ཏོག་གི་ནང་དུ་བཅུག་ལ་བཅངས་ཀྱང་རུང་ངོ་། །
en: Therefore, it is appropriate that we brahmins from an outlying island should keep a relic the size of a mustard seed in a casket, for by possessing it, beings will soon become lords of Trāyastriṃśa.

source: ཀྱེ་ལིཙྪ་བཱི་གཞོན་ནུ་ཁྱོད་ཅི་དེ་བཞིན་གཤེགས་པ་ལས་རིང་བསྲེལ་ཡུངས་འབྲུ་ཙམ་གསོལ་ནས། རིང་བསྲེལ་ཟ་མ་ཏོག་གི་ནང་དུ་བཅུག་སྟེ། བཅངས་པས་སེམས་ཅན་རྣམས་སུམ་ཅུ་རྩ་གསུམ་གྱི་བདག་པོ་ཐོབ་པར་མི་འདོད་དམ།
en: “O Licchavī youth, don’t you want to request a relic the size of a mustard seed from the Tathāgata, place the relic in a casket, and possess it so that beings will become lords of Trāyastriṃśa?

source: ཀྱེ་ལིཙྪ་བཱི་གཞོན་ནུ་ཁོ་བོས་ནི་དམ་པ་དེ་ལྟ་བུ་གསོལ་ཏོ། །དེ་ནས་ལིཙྪ་བཱི་གཞོན་ནུ་སེམས་ཅན་ཐམས་ཅད་ཀྱིས་མཐོང་ན་དགའ་བས།
en: “O Licchavī youth, that is the sublime thing that I have requested.”

source: སློབ་དཔོན་ལུང་སྟོན་པ་བྲམ་ཟེ་ཀཽཎྜི་ནྱ་ལ་ཚིགས་སུ་བཅད་པ་དག་གིས་སླར་སྨྲས་པ། ནམ་ཞིག་གང་གཱའི་ཆུ་རྒྱུན་ལས། །མེ་ཏོག་རྣམས་ནི་སྐྱེ་བ་དང་། །བྱ་རོག་དམར་པོར་འགྱུར་བ་དང་། །ཁུ་བྱུག་དུང་མདོག་འདྲར་འགྱུར་དང་། །འཛམ་བུར་ཏ་ལའི་འབྲུ་ཆགས་དང་། །བྲ་གོར་ཨ་མྲའི་དོག་པ་ཆགས། །
en: Then Sarva­sattva­priya­darśana, the Licchavī youth, recited these verses to the Kauṇḍinya brahmin, the Dharma master Vyākaraṇa: “When flowers grow On the Ganges River, Crows become red, And cuckoos become conch-colored; “When palm-tree fruit grow on rose-apple trees; And when bunches of mangoes grown on date trees, That will be the time when a relic The size of a mustard seed will appear.

source: དེ་ཡི་ཚེ་ན་ཡུངས་འབྲུ་ཙམ། །རིང་བསྲེལ་དུ་ནི་སྩལ་བར་འགྱུར། །ནམ་ཞིག་རུ་སྦལ་སྤུ་རྣམས་ལས། །གོས་སུ་ལེགས་པར་བཏགས་གྱུར་ཏེ། །དགུན་གྱི་གྲང་བ་སེལ་བྱེད་པ། །
en: “When clothes made from The hair of turtles are worn, And they dispel the cold of winter, Then there will be a relic.

source: དེ་ཚེ་རིང་བསྲེལ་ཡོད་པར་འགྱུར། །ནམ་ཞིག་སྦྲང་བུའི་རྐང་ལག་ལས། །ཡང་ཐོག་ལེགས་པར་བྱས་གྱུར་ཏེ། །བརྟན་ཞིང་རབ་ཏུ་མི་གཡོ་ན། །
en: “When roofs are made From the legs of flies And are solid and stable, Then there will be a relic.

source: དེ་ཚེ་རིང་བསྲེལ་ཡོད་པར་འགྱུར། །ནམ་ཞིག་སྲིན་བུ་པདྨ་ཀུན། །སོ་ནི་དཀར་པོར་སྐྱེས་གྱུར་ཏེ། །རྣོ་ཞིང་ཆེན་པོར་གྱུར་པ་ན། །དེ་ཚེ་རིང་བསྲེལ་ཡོད་པར་འགྱུར། །
en: “When all the leeches Grow teeth that are Long, white, and sharp, Then there will be a relic.

source: མཐོ་རིས་སུ་ནི་འཛེག་པའི་ཕྱིར། །ནམ་ཞིག་རི་བོང་རྭ་རྣམས་ལས། །སྐས་ནི་ལེགས་པར་བྱས་གྱུར་པ། །དེ་ཚེ་རིང་བསྲེལ་ཡོད་པར་འགྱུར། །
en: “When a ladder is built From the horns of hares For climbing to the upper realms, Then there will be a relic.

source: ནམ་ཞིག་སྐས་ནི་དེར་འཛེགས་ཏེ། །བྱི་བས་ཟླ་བ་ཟ་བ་དང་། །སྒྲ་གཅན་ལ་ཡང་གནོད་བྱེད་པ། །དེ་ཚེ་རིང་བསྲེལ་ཡོད་པར་འགྱུར། །
en: “When a mouse climbs that ladder And then eats the moon And attacks the eclipse, Then there will be a relic.

source: གྲོང་དུ་རྒྱུ་བའི་སྦྲང་བུ་ཡིས། །ནམ་ཞིག་རྫ་མའི་ཆང་འཐུངས་ཏེ། །ཁྱིམ་ན་གནས་པར་བྱེད་གྱུར་པ། །དེ་ཚེ་རིང་བསྲེལ་ཡོད་པར་འགྱུར། །
en: “When a village-dwelling fly Drinks a pitcher of beer And lives in a house, Then there will be a relic.

source: ནམ་ཞིག་བོང་བུ་བདེར་གྱུར་ལ། །མཆུ་དམར་བིམ་པ་འདྲར་གྱུར་ཞིང་། །གླུ་གར་རྣམས་ལ་མཁས་གྱུར་པ། །དེ་ཚེ་རིང་བསྲེལ་ཡོད་པར་འགྱུར། །
en: “When a happy donkey Has lips as red as a bimba fruit And is expert in song and dance, Then there will be a relic.

source: ནམ་ཞིག་འུག་པ་བྱ་རོག་རྣམས། །དབེན་པར་དོང་ནས་རྩེ་བ་དང་། །ཕན་ཚུན་མཐུན་པར་འགྱུར་བ་ན། །དེ་ཚེ་རིང་བསྲེལ་ཡོད་པར་འགྱུར། །
en: “When owls and crows Cavort together in private And live together in harmony, Then there will be a relic.

source: བ་ལ་ཤ་ཡི་ལོ་མ་རྣམས། །རིན་ཆེན་སྣ་གསུམ་གདུགས་གྱུར་ཏེ། །ཆར་འབབ་སྐྱབས་སུ་ནམ་འགྱུར་བ། །
en: “When the leaves of the palash tree Become a parasol of three kinds of jewels And provide shelter from the falling rain, Then there will be a relic.

source: དེ་ཚེ་རིང་བསྲེལ་ཡོད་པར་འགྱུར། །ནམ་ཞིག་རྒྱ་མཚོའི་གྲུ་བོ་ཚེ། །འཁྲུལ་འཁོར་དང་ནི་གཡོར་མོར་བཅས། །ཐང་ལ་ཕྱུང་སྟེ་འགྲོ་བ་ན། །དེ་ཚེ་རིང་བསྲེལ་ཡོད་པར་འགྱུར། །
en: “When a great oceangoing ship, With its instruments and sails, Comes onto and travels over dry land, Then there will be a relic.

source: ནམ་ཞིག་བྱ་ནི་འུག་པ་རྣམས། །རི་བོ་སྤོས་ཀྱི་ངད་ལྡང་བ། །མཆུ་ལ་ཐོགས་ཏེ་འགྲོ་འགྱུར་བ། །དེ་ཚེ་རིང་བསྲེལ་ཡོད་པར་འགྱུར། །
en: “When an owl picks up Gandhamādana Mountain In its beak and flies away, Then there will be a relic.”

source: སློབ་དཔོན་ལུང་སྟོན་པ་བྲམ་ཟེ་ཀཽཎྜི་ནྱས་ཚིགས་སུ་བཅད་པ་འདི་དག་ཐོས་ནས། ལིཙྪ་བཱི་གཞོན་ནུ་འཇིག་རྟེན་ཐམས་ཅད་ཀྱིས་མཐོང་ན་དགའ་བ་ལ་ཚིགས་སུ་བཅད་པ་འདི་དག་གིས་སླར་སྨྲས་པ། །ལེགས་སོ་ལེགས་སོ་གཞོན་ནུ་མཆོག །རྒྱལ་བའི་སྲས་པོ་ཚིག་པོ་ཆེ། །
en: On hearing those verses, the Kauṇḍinya brahmin, the Dharma master Vyākaraṇa, replied to the Licchavī youth Sarva­sattva­priya­darśana with these verses: “Good!

source: དཔའ་ཞིང་ཐབས་ལ་མཁས་ལྡན་པ། །
en: Good!

source: ལུང་བསྟན་པ་ནི་དམ་པ་ཐོབ། །འཇིག་རྟེན་མགོན་པོ་སྐྱོབ་པ་པོ། །དེ་བཞིན་གཤེགས་པ་ཆེ་བ་ཉིད། །བསམ་གྱིས་མི་ཁྱབ་གོ་རིམས་བཞིན། །གཞོན་ནུས་བདག་ལ་མཉན་པར་གྱིས། །
en: Best of youths, Son of the jinas, with great words, Skilled in methods, heroic, Who has received the highest prophecy, “Young man, listen to me describe, In order, the inconceivable Greatness of the world’s lord, The protector, the Tathāgata.

source: སངས་རྒྱས་ཡུལ་ནི་བསམ་མི་ཁྱབ། །
en: “The scope of the buddhas is inconceivable.

source: དེ་བཞིན་གཤེགས་རྣམས་མཚུངས་པ་མེད། །
en: The tathāgatas are without any equal.

source: སངས་རྒྱས་ཐམས་ཅད་རྟག་ཏུ་ཞི། །
en: All buddhas are always in peace.

source: སངས་རྒྱས་ཐམས་ཅད་ཡང་དག་འབྱུང་། །
en: All buddhas appear perfectly.

source: སངས་རྒྱས་ཐམས་ཅད་ཁ་དོག་མཚུངས། །འདི་ནི་སངས་རྒྱས་ཆོས་ཉིད་ཡིན། །
en: “All buddhas have the same color; That is the intrinsic nature of the buddhas.

source: བཅོམ་ལྡན་འདི་ནི་བཅོས་མ་མིན། །དེ་བཞིན་གཤེགས་པ་མ་སྐྱེས་ཏེ། །
en: The Bhagavat is not fabricated, And the Tathāgata is not produced.

source: རྡོ་རྗེ་ལྟ་བུར་སྲ་བའི་སྐུ། །
en: “He has a body like a vajra.

source: སྤྲུལ་པའི་སྐུ་ནི་སྟོན་པར་མཛད། །
en: He manifests an illusory body.

source: དྲང་སྲོང་ཆེན་པོའི་རིང་བསྲེལ་ནི། །ཡུངས་འབྲུ་ཙམ་ཞེས་བྱ་བ་མེད། །
en: The great Ṛṣi does not have relics, Not even of the size of a mustard seed.

source: སྐུ་ལ་རུས་པ་ཁྲག་མེད་ན། །རིང་བསྲེལ་ཡོད་པར་ག་ལ་འགྱུར། །
en: “How could there be relics From a body without bones or blood?

source: སེམས་ཅན་རྣམས་ལ་ཕན་པའི་ཕྱིར། །ཐབས་ཀྱིས་རིང་བསྲེལ་བཞག་པར་མཛད། །
en: Relics are left through skillful methods In order to bring benefit to beings.

source: རྫོགས་པའི་སངས་རྒྱས་ཆོས་ཀྱི་སྐུ། །
en: “The perfect Buddha is a Dharma body.

source: དེ་བཞིན་གཤེགས་པ་ཆོས་ཀྱི་དབྱིངས། །
en: The Tathāgata is a Dharma realm.

source: ཆོས་སྟོན་མཛད་པ་ཅི་འདྲ་བ། །བཅོམ་ལྡན་འདས་ཀྱི་སྐུ་དེ་འདྲ། །
en: That is what the Bhagavat’s body is like. That is what teaching the Dharma is like.

source: བདག་གིས་འདི་ཐོས་ཤེས་ནས་ནི། །བདག་གིས་དམ་པ་གསོལ་བར་བྱས། །དེ་ཉིད་ཁོ་ན་ལུང་བསྟན་ཕྱིར། །
en: “I made that request for the sacred object Having already heard and understood that.

source: གཏམ་གླེང་བ་ནི་བདག་གིས་བྱས། །
en: I spoke in that way In order to reveal the truth.”

source: དེ་ནས་ལྷའི་བུ་སུམ་ཁྲི་ཉིས་སྟོང་གིས་དེ་བཞིན་གཤེགས་པའི་སྐུ་ཚེའི་ཚད་བསྟན་པ་ཟབ་མོ་དེ་ལྟ་བུ་འདི་ཐོས་ནས། ཐམས་ཅད་ཀྱང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དེ།
en: Then thirty-two thousand devas, having heard that profound teaching on the lifespan of the Tathāgata, all developed the aspiration for the highest, most complete enlightenment.

source: དེ་དག་ཡིད་ཀྱི་ཀུན་དུ་རྟོག་པ་རབ་ཏུ་དགའ་ནས། སྒྲ་སྐད་མཐུན་པར་ཚིགས་སུ་བཅད་པ་འདི་དག་སྨྲས་སོ། །སངས་རྒྱས་མྱ་ངན་ཡོངས་མི་འདའ། །
en: With joyful mental thoughts and with one voice, they recited these verses: “The Buddha does not pass away.

source: ཆོས་ཀྱང་ནུབ་པར་མི་འགྱུར་ཏེ། །
en: The Dharma does not disappear.

source: སེམས་ཅན་ཡོངས་སུ་སྨིན་མཛད་ཕྱིར། །ཡོངས་སུ་མྱ་ངན་འདའ་བ་སྟོན། །
en: Passing into nirvāṇa is manifested In order to bring beings to maturity.

source: སངས་རྒྱས་བཅོམ་ལྡན་བསམ་མི་ཁྱབ། །དེ་བཞིན་གཤེགས་པ་རྟག་པའི་སྐུ། །
en: “The Bhagavat is inconceivable; The Tathāgata’s body is eternal.

source: སེམས་ཅན་རྣམས་ལ་ཕན་པའི་ཕྱིར། །བཀོད་པ་རྣམ་པ་སྣ་ཚོགས་སྟོན། །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་མཛེས་པའི་ཏོག་གིས། སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་དང་། སྐྱེས་བུ་དམ་པ་དེ་གཉིས་ལས། བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པའི་སྐུ་ཚེའི་ཚད་བསྟན་པ་ཐོས་ནས་ཡང་སྟན་ལས་ལངས་ཏེ། ཐལ་མོ་སྦྱར་བ་བཏུད་ནས། འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: He demonstrates a variety of displays In order to bring benefit to beings.”

source: བཅོམ་ལྡན་འདས་དེ་ལྟར་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་མྱ་ངན་ལས་མི་འདའ་ལ། རིང་བསྲེལ་འཇིག་རྟེན་དུ་བཞག་པ་ཡང་མ་མཆིས་ན། ཅིའི་སླད་དུ་མདོ་སྡེ་དག་ལས་སངས་རྒྱས་མྱ་ངན་ལས་འདའ་ཞིང་། རིང་བསྲེལ་འཇིག་རྟེན་དུ་བཞག་པ་ལ་ལྷ་དང་མིས་གུས་པ་དང་བཅས། བཀུར་སྟི་དང་བཅས་པས་འདས་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་རིང་བསྲེལ་འཇིག་རྟེན་དུ་བཞག་པ་ལ་ལྷ་དང་མིར་བཅས་པའི་འཇིག་རྟེན་གྱིས་མཆོད་པ་བྱས་ན། བསོད་ནམས་དཔག་ཏུ་མེད་པ་འཐོབ་པོ་ཞེས་ཀྱང་གསུངས་ལ།
en: Then the bodhisattva Ruciraketu, having heard the teaching on the lifespan of the Bhagavat Śākyamuni from both those buddha bhagavats and those excellent individuals, arose from his seat, and with his palms together in homage, bowed and said, “Bhagavat, if in that way the buddha bhagavats do not pass into nirvāṇa and do not leave relics in the world, why is it that in the sūtras it is taught that the buddhas pass into nirvāṇa and leave their relics in the world so that if devas and humans have veneration and respect toward the relics of past buddhas that have been left in the world, and if the world with its devas and humans makes offerings to them, they will attain immeasurable benefit?

source: ད་འདིར་ནི་དེ་དག་མེད་དོ་ཞེས་ཀྱང་གསུངས་པ་དེ་ཇི་ལྟ་བུ་ལགས།
en: And why is it said here that there are no relics, Bhagavat?

source: བཅོམ་ལྡན་འདས་ཐུགས་བརྩེ་བས་རྣམ་པར་དབྱེ་ཞིང་བཤད་པར་གསོལ།
en: I pray that with compassion you will explain and teach this.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་མཛེས་པའི་ཏོག་ལ་སོགས་པའི་འཁོར་འདུས་པ་དེ་དག་ལ་བཀའ་སྩལ་པ། བཅོམ་ལྡན་འདས་མྱ་ངན་ལས་འདས་ཏེ། རིང་བསྲེལ་འཇིག་རྟེན་དུ་བཞག་ཅེས་གསུངས་པ་ཡང་དགོངས་པའི་དོན་དུ་བསྟན་པར་ཤེས་པར་བྱའོ། །
en: The Bhagavat then said to the bodhisattva mahāsattva Ruciraketu and the rest of the gathered assembly, “Know that when it is said that the bhagavats pass into nirvāṇa and leave relics in the world that this is a teaching with an implied meaning.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་འདི་བཅུས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱིས་ཡང་དག་པ་དང་། བདེན་པའི་ཚུལ་དུ་མྱ་ངན་ལས་འདས་པ་ཆེན་པོ་ཡོད་པར་གསུངས་པར་ཤེས་པར་བྱའོ། །
en: “Noble ones, the bodhisattva mahāsattvas know through these ten qualities that the Tathāgata Arhat Samyaksaṃbuddha correctly and truly teaches that there is a great passing into nirvāṇa.

source: བཅུ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: “What are these ten?

source: དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱིས་ཉོན་མོངས་པའི་སྒྲིབ་པ་དང་། ཤེས་བྱའི་སྒྲིབ་པ་ཡོངས་སུ་སྤངས་པས་མྱ་ངན་ལས་འདས་པ་ཞེས་བྱ་བ་དང་།
en: “First, nirvāṇa means that the tathāgatas have completely eliminated the obscuration of the kleśas and the obscuration of knowledge.

source: དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱིས་གང་ཟག་ལ་བདག་མེད་པ་དང་། ཆོས་ལ་བདག་མེད་པ་མངོན་དུ་མཁྱེན་པས་མྱ་ངན་ལས་འདས་པ་ཞེས་བྱ་བ་དང་།
en: “Second, nirvāṇa means that the tathāgatas know that there is no self in the individual and no self in phenomena.

source: ལུས་ཀྱི་གནས་དང་། ཆོས་ཀྱི་གནས་སུ་གྱུར་པས་མྱ་ངན་ལས་འདས་པ་ཞེས་བྱ་བ་དང་།
en: “Third, nirvāṇa means that there is a transformation of the body and of qualities.

source: སེམས་ཅན་རྣམས་འདུལ་བའི་མཛད་པ་ལྷུན་གྱིས་གྲུབ་པའི་ཕྱིར་མྱ་ངན་ལས་འདས་པ་ཞེས་བྱ་བ་དང་།
en: “Fourth, nirvāṇa means that there is a spontaneous guidance of beings.

source: ཡང་དག་པ་ཉིད་མངོན་དུ་གྱུར་པས་མཚན་ཉིད་ཐ་དད་པ་མེད་པས་ཆོས་ཀྱི་སྐུར་མཉམ་པའི་ཕྱིར་མྱ་ངན་ལས་འདས་པ་ཞེས་བྱ་བ་དང་། འཁོར་བ་དང་མྱ་ངན་ལས་འདས་པའི་རང་བཞིན་གཉིས་སུ་མེད་པར་མངོན་དུ་གཟིགས་པས།
en: “Fifth, nirvāṇa means that there is sameness in the Dharma body because there is no differentiation of characteristics through the truth becoming manifest.

source: མྱ་ངན་ལས་འདས་པ་ཞེས་བྱ་བ་དང་།
en: “Sixth, nirvāṇa means that there is no duality between the nature of saṃsāra and nirvāṇa.

source: ཆོས་ཐམས་ཅད་ཀྱི་ངོ་བོ་ཉིད་རྟོགས་པས། རྣམ་པར་དག་པ་མངོན་དུ་གྱུར་པའི་ཕྱིར་མྱ་ངན་ལས་འདས་པ་ཞེས་བྱ་བ་དང་།
en: “Seventh, nirvāṇa means that purity is manifested through the realization of the essence of phenomena.

source: ཆོས་ཐམས་ཅད་སྐྱེ་བ་དང་། འཇིག་པ་མེད་པའི་སྒྲུབ་པ་ལ་མཁས་པས་མྱ་ངན་ལས་འདས་པ་ཞེས་བྱ་བ་དང་།
en: “Eighth, nirvāṇa means that there has been the skillful accomplishment of all phenomena being devoid of birth and devoid of destruction.

source: དེ་བཞིན་ཉིད་དང་། ཆོས་ཀྱི་དབྱིངས་དང་། ཡང་དག་པའི་མཐའ་མཉམ་པའི་ཡེ་ཤེས་ཐོབ་པའི་ཕྱིར་མྱ་ངན་ལས་འདས་པ་ཞེས་བྱ་བ་དང་།
en: “Ninth, nirvāṇa means that there is the attainment of the wisdom of the equality of the true nature, the realm of phenomena, and the ultimate conclusion.

source: ཆོས་ཐམས་ཅད་ཀྱི་དེ་བཞིན་ཉིད་དང་མྱ་ངན་ལས་འདའ་བའི་དེ་བཞིན་ཉིད་ལ་བྱེ་བྲག་མེད་པར་མཁྱེན་པས་མྱ་ངན་ལས་འདས་པ་ཞེས་བྱའོ། །
en: “Tenth, nirvāṇa means that there is the knowledge that there is no difference between the nature of all phenomena and the nature of nirvāṇa.

source: གཞན་ཡང་རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་འདི་བཅུས་ནི། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱིས་ཡང་དག་པ་དང་། བདེན་པའི་ཚུལ་དུ་མྱ་ངན་ལས་འདས་པ་ཆེན་པོ་ཡོད་པར་གསུངས་སོ། །
en: “Also, noble one, the bodhisattva mahāsattvas know through these ten qualities that the Tathāgata Arhat Samyaksaṃbuddha correctly and truly teaches that there is a great passing into nirvāṇa.

source: ཉོན་མོངས་པ་ཐམས་ཅད་ཀྱི་གཞི་ནི་མོས་པ་དང་། འདོད་པ་སྟེ། གང་ལ་མོས་པ་ལ་འདོད་པ་སྐྱེའོ། །
en: “First, aspiration and desire are the basis of the kleśas; whatever one aspires to creates desire.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ནི་མོས་པ་དང་། འདོད་པ་ལས་བྲལ་བའི་ཕྱིར་མྱ་ངན་ལས་འདས་པ་ཞེས་བྱ་བ་དང་།
en: The buddha bhagavats are free of aspiration and desire, and this is called nirvāṇa.

source: དེ་བཞིན་གཤེགས་པ་རྣམས་ནི་མོས་པ་དང་། འདོད་པ་ཐམས་ཅད་དང་བྲལ་ནས། ཆོས་གང་ཡང་མི་ལེན་པའི་ཕྱིར་གཟུང་བ་མེད་པ་དང་། འགྲོ་བ་དང་། འོང་བ་དང་།
en: “Second, the tathāgatas are free of all aspiration and desire; they do not acquire any phenomena and therefore have no possessions, no going, no coming, and nothing to be acquired.

source: ལེན་པ་མེད་པ་སྟེ། དེའི་ཕྱིར་མྱ་ངན་ལས་འདས་པ་ཞེས་བྱ་བ་དང་།
en: Therefore, this is called nirvāṇa.

source: འགྲོ་བ་དང་། འོང་བ་དང་། བླང་བར་བྱ་བ་མེད་པ་དེ་ནི་ཆོས་ཀྱི་སྐུ་སྟེ། སྐྱེ་བ་དང་། འགོག་པ་མེད་པའོ། །
en: “Third, that absence of going and coming and acquisition is the Dharma body, which has no birth and no cessation; this absence of birth and cessation is called nirvāṇa.

source: སྐྱེ་བ་དང་། འགོག་པ་མེད་པ་དེ་ཉིད་ལ། མྱ་ངན་ལས་འདས་པ་ཞེས་བྱ་བ་དང་། སྐྱེ་བ་དང་། འགོག་པ་མེད་པ་དེ་ཚིག་གིས་མི་བརྗོད་པ་ཚིག་གི་ལམ་ཆད་པའི་ཕྱིར་མྱ་ངན་ལས་འདས་པ་ཞེས་བྱ་བ་དང་།
en: “Fourth, that absence of birth and cessation is indescribable by words and transcends the scope of words.

source: བདག་དང་གང་ཟག་མེད་ཅིང་སྐྱེ་བ་དང་། འགག་པའི་ཆོས་ཙམ་ལས་གནས་འཕོ་བ་ཐོབ་པའི་ཕྱིར་མྱ་ངན་ལས་འདས་པ་ཞེས་བྱ་བ་དང་།
en: Therefore, this is called nirvāṇa. “Fifth, there is the attainment of a transference from one state of existence to another merely through the phenomena of birth and cessation, without there being a self or an individual.

source: ཉོན་མོངས་པ་དང་།
en: Therefore, this is called nirvāṇa.

source: ཉེ་བའི་ཉོན་མོངས་པ་དག་བློ་བུར་ཉིད་དུ་གཟིགས་ཤིང་། གང་ཆོས་ཉིད་དེ་ནི་གནས་པ་སྟེ། འགྲོ་བ་དང་འོང་བ་མེད་པར་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཀྱིས་མངོན་དུ་གྱུར་པའི་ཕྱིར།
en: “Sixth, the buddha bhagavats directly see that the kleśas and the proximate kleśas are incidental and that the true nature, which has no coming or going, remains.

source: ཡང་དག་པ་ནི་བདེན་པ་སྟེ། དེ་ལས་གཞན་པ་ནི་བརྫུན་པའོ། །
en: “Seventh, that which is valid is true, and everything else is false.

source: གང་བདེན་པ་དེ་ཉིད་ནི་ཡང་དག་པ་སྟེ། ཡང་དག་པ་ཉིད་ནི་དེ་བཞིན་གཤེགས་པ་ཉིད་པས།
en: That which is true is valid, and that validity is the nature of a tathāgata.

source: དེ་ལ་མྱ་ངན་ལས་འདས་པ་ཞེས་བྱ་བ་དང་།
en: Therefore, this is called nirvāṇa.

source: ཡང་དག་པའི་མཐའ་ཉིད་ནི་སྤྲོས་པ་མེད་པ། དེ་བཞིན་གཤེགས་པ་ཉག་གཅིག་གིས་ཡང་དག་པའི་མཐའ་མངོན་དུ་གྱུར་ཅིང་། སྤྲོས་པ་ཉེ་བར་ཞི་བ་དེ་ཉིད་ལ་མྱ་ངན་ལས་འདས་པ་ཞེས་བྱ་བ་དང་།
en: “Eighth, the ultimate conclusion is free of complication; a tathāgata alone manifests that ultimate conclusion, and this ceasing of complication is called nirvāṇa.

source: མི་སྐྱེ་བ་ནི་བདེན་པ། སྐྱེ་བ་ནི་བརྫུན་པ་ཡིན་པས། བྱིས་པ་སོ་སོའི་སྐྱེ་བོ་རྣམས་ནི་འཁོར་བའི་འདམ་དུ་བྱིང་བ། དེ་བཞིན་གཤེགས་པའི་སྐུ་ནི་བདེན་པ་ཡང་དག་པ་མ་ཡིན་པ་མེད་པའི་ཕྱིར།
en: “Ninth, birthlessness is truth, and birth is falsity; therefore, foolish ordinary beings sink into the swamp of saṃsāra, while the body of a tathāgata is the truth without any invalidity.

source: ཡང་དག་པ་མ་ཡིན་པའི་ཆོས་ནི་རྐྱེན་ལས་སྐྱེ་བ། ཡང་དག་པ་བདེན་པའི་ཆོས་ནི་རྐྱེན་གྱིས་བསྐྱེད་པ་མ་ཡིན་པ། དེ་བཞིན་གཤེགས་པ་ཆོས་ཀྱི་སྐུ་ཡང་ཡང་དག་པ།
en: “Tenth, invalid phenomena are born from conditions; the phenomenon that is the valid truth is not created by conditions, and the Dharma body of a tathāgata is valid and is truth.

source: བདེན་པ་ཉིད་ཡིན་པས་དེ་ལ་མྱ་ངན་ལས་འདས་པ་ཞེས་བྱའོ། །
en: Therefore, this is called nirvāṇa.

source: གཞན་ཡང་རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་རྣམ་པ་འདི་བཅུས་ནི། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ཀྱི་ཡང་དག་པ་དང་། བདེན་པའི་ཚུལ་རྟོགས་པས། མྱ་ངན་ལས་འདས་པ་ཆེན་པོར་ཤེས་པར་འགྱུར་རོ། །
en: “Also, noble one, a bodhisattva mahāsattva will realize the way of validity and truth of the tathāgata arhat samyaksaṃbuddhas through ten qualities, and therefore they are called the great nirvāṇa.

source: དེ་བཞིན་གཤེགས་པས་སྦྱིན་པ་དང་། སྦྱིན་པའི་འབྲས་བུ་ལ་བདག་དང་། བདག་གིར་བྱ་བ་མེད་པར་རབ་ཏུ་ཤེས་པས་སྦྱིན་པ་དེ་དང་། དེའི་འབྲས་བུ་ལ་ལོག་པའི་རྣམ་པར་རྟོག་པ་ཡོངས་སུ་སྤངས་པས།
en: “First, the tathāgatas have rejected incorrect concepts of generosity and its results because they know that there is no ‘me’ or ‘mine’ in generosity or the results of generosity; therefore; this is called nirvāṇa.

source: མྱ་ངན་ལས་འདས་པ་ཞེས་བྱ་བ་དང་། དེ་བཞིན་གཤེགས་པས་ཚུལ་ཁྲིམས་དང་། ཚུལ་ཁྲིམས་ཀྱི་འབྲས་བུ་ལ་བདག་དང་བདག་གིར་བྱ་བ་མེད་པར་རབ་ཏུ་ཤེས་པས། ཚུལ་ཁྲིམས་དེ་དང་དེའི་འབྲས་བུ་ལ་ལོག་པའི་རྣམ་པར་རྟོག་པ་ཡོངས་སུ་སྤངས་པས།
en: “Second, the tathāgatas have rejected incorrect concepts of correct conduct and its results because they know that there is no ‘me’ or ‘mine’ in correct conduct or the results of correct conduct; therefore, this is called nirvāṇa.

source: མྱ་ངན་ལས་འདས་པ་ཞེས་བྱ་བ་དང་། དེ་བཞིན་གཤེགས་པས་བཟོད་པ་དང་། བཟོད་པའི་འབྲས་བུ་ལ་བདག་དང་བདག་གིར་བྱ་བ་མེད་པར་རབ་ཏུ་ཤེས་པས། བཟོད་པ་དེ་དང་དེའི་འབྲས་བུ་ལ་ལོག་པའི་རྣམ་པར་རྟོག་པ་ཡོངས་སུ་སྤངས་པས།
en: “Third, the tathāgatas have rejected incorrect concepts of patience and its results because they know that there is no ‘me’ or ‘mine’ in patience or the results of patience; therefore, this is called nirvāṇa.

source: མྱ་ངན་ལས་འདས་པ་ཞེས་བྱ་བ་དང་། དེ་བཞིན་གཤེགས་པས་བརྩོན་འགྲུས་དང་། བརྩོན་འགྲུས་ཀྱི་འབྲས་བུ་ལ་བདག་དང་བདག་གིར་བྱ་བ་མེད་པར་རབ་ཏུ་ཤེས་པས། བརྩོན་འགྲུས་དེ་དང་དེའི་འབྲས་བུ་ལ་ལོག་པའི་རྣམ་པར་རྟོག་པ་ཡོངས་སུ་སྤངས་པས།
en: “Fourth, the tathāgatas have rejected incorrect concepts of diligence and its results because they know that there is no ‘me’ or ‘mine’ in diligence or the results of diligence; therefore; that is called nirvāṇa.

source: མྱ་ངན་ལས་འདས་པ་ཞེས་བྱ་བ་དང་། དེ་བཞིན་གཤེགས་པས་བསམ་གཏན་དང་། བསམ་གཏན་གྱི་འབྲས་བུ་ལ་བདག་དང་བདག་གིར་བྱ་བ་མེད་པར་རབ་ཏུ་ཤེས་པས། བསམ་གཏན་དེ་དང་དེའི་འབྲས་བུ་ལ་ལོག་པའི་རྣམ་པར་རྟོག་པ་ཡོངས་སུ་སྤངས་པས། མྱ་ངན་ལས་འདས་པ་ཞེས་བྱ་བ་དང་།
en: “Fifth, the tathāgatas have rejected incorrect concepts of meditation and its results because they know that there is no ‘me’ or ‘mine’ in meditation or the results of meditation; therefore, this is called nirvāṇa.

source: དེ་བཞིན་གཤེགས་པས་ཤེས་རབ་དང་། ཤེས་རབ་ཀྱི་འབྲས་བུ་ལ་བདག་དང་བདག་གིར་བྱ་བ་མེད་པར་རབ་ཏུ་ཤེས་པས། ཤེས་རབ་དེ་དང་དེའི་འབྲས་བུ་ལ་ལོག་པའི་རྣམ་པར་རྟོག་པ་ཡོངས་སུ་སྤངས་པས། མྱ་ངན་ལས་འདས་པ་ཞེས་བྱ་བ་དང་།
en: “Sixth, the tathāgatas have rejected incorrect concepts of wisdom and its results because they know that there is no ‘me’ or ‘mine’ in wisdom or the results of wisdom; therefore, this is called nirvāṇa.

source: དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱིས་སེམས་ཅན་དང་། སེམས་ཅན་མེད་པར་རབ་ཏུ་མཁྱེན་པ་དང་། ཆོས་ཐམས་ཅད་ཀྱི་རང་བཞིན་མེད་པ་ལ། ལོག་པའི་རྣམ་པར་རྟོག་པ་ཡོངས་སུ་སྤངས་པས། མྱ་ངན་ལས་འདས་པ་ཞེས་བྱ་བ་དང་།
en: “Seventh, the tathāgatas have rejected incorrect concepts concerning beings, the absence of beings, and the absence of an intrinsic nature in all phenomena because they know these; therefore, this is called nirvāṇa.

source: གང་སྲེད་པའི་བདག་ཉིད་ཅན་ནི་ཚོར་བ་ལ་ནན་ཏན་བྱེད་དོ། །
en: “Eighth, the tathāgatas know that someone whose nature is characterized by craving is engaged in seeking.

source: ཚོར་བ་ལ་ནན་ཏན་བྱེད་པའི་དབང་གིས་སྡུག་བསྔལ་རྣམ་པ་སྣ་ཚོགས་མྱོང་བར་འགྱུར་རོ། །
en: Through the power of being engaged in seeking there will be the experience of various sufferings.

source: དེ་བཞིན་གཤེགས་པ་རྣམས་ནི་བདག་དང་བདག་གིར་འཛིན་པ་ཡོངས་སུ་བཅད་ཅིང་ཚོལ་བ་མི་མངའ་བས། མྱ་ངན་ལས་འདས་པ་ཞེས་བྱ་བ་དང་།
en: The tathāgatas have eliminated fixation on ‘me’ and ‘mine’ and have no seeking; therefore, this is called nirvāṇa.
